snlkuharlocal/src/Documents/ОплатаПлатежнойКартой/ОплатаПлатежнойКартой.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаПлатежнойКартой</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринятоОт</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекПробитНаККМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЧекаККМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

snlkuharlocal/src/Enums/ВидыОперацийПКО/ВидыОперацийПКО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПКО</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ОплатаПокупателя</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
  </enumValues>
  <enumValues>
    <name>НедовложениеВИнкассацию</name>
  </enumValues>
  <enumValues>
    <name>ПриходДенежныхСредствПрочее</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратАвансовыйОтчет</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ОплатаПлатежнойКартой/ObjectModule.bsl
//Катаев+ 06/10/14
Перем НужноВыгружать;
//Катаев- 06/10/14

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт	
	КонецПроцедуры

//СОБЫТИЯ ОБЪЕКТА
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	ЕстьИзменения		=Модифицированность();
	НужноВыгружать		=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	
	Если НЕ ОбменДанными.Загрузка Тогда		
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		
		//кухарь 19.11.14 начало
		//запрет проведения ПКО задним числом
		//кухарь 23.12.14 начало
		//если НачалоДня(Дата)<НачалоДня(ТекущаяДата()) и не РольДоступна("Администратор") тогда
		//кухарь 12.01.15 начало
		//оставляем только для филиалов
		//если НачалоДня(Дата)<НачалоДня(ТекущаяДата()) и не РольДоступна("Администратор") и ПараметрыСеанса.ЭтотУзел.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение  Тогда 
		//крохин начало 07.07.2015
		//для семеновского открываем
		//если НачалоДня(Дата)<НачалоДня(ТекущаяДата()) и не РольДоступна("Администратор") и ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение и ПараметрыСеанса.ЭтотУзел.Подразделение.ЕстьВыделенныйСклад  Тогда 
		//крохин начало 27.07.2016
		//снова всем разрешаем
		//если НачалоДня(Дата)<НачалоДня(ТекущаяДата()) и не РольДоступна("Администратор") и ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение и ПараметрыСеанса.ЭтотУзел.Подразделение.ЕстьВыделенныйСклад И НЕ ПараметрыСеанса.ЭтотУзел.Код = "SEM" Тогда 
		Если Ложь Тогда
		//крохин конец 27.07.2016	
		//крохин конец 07.07.2015	
        //кухарь 12.01.15 конец
 
		//кухарь 23.12.14 конец	
		#Если клиент тогда
			//крохин начало 07.07.2015
				//Сообщить("Проведение кассовых документов задним число - запрещена!");
				Сообщить("Проведение кассовых документов задним числом запрещено!");
			//крохин конец 07.07.2015	
				Отказ=Истина;
			#КонецЕсли
		КонецЕсли;
		//кухарь 19.11.14 конец	
		
		Если Отказ Тогда Возврат КонецЕсли; 		
	КонецЕсли;	
	
	Если Отказ Тогда Возврат КонецЕсли;
	
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
		//Катаев+ 08/10/14
		Если Не ЭтотОбъект.Ссылка.Пустая() Тогда
			НужноВыгружать = Ложь;
		КонецЕсли;
		//Катаев- 08/10/14
	КонецЕсли;
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДокументОснование)
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
	
	ДокОснование		= ДокументОснование;
	
	Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда		
		ИБ 					= ДокОснование.ИБ;
		Организация 		= ДокОснование.Организация;
		Подразделение		= ДокОснование.Склад.Подразделение;
		
		Контрагент 			= ДокОснование.Контрагент;
		ПринятоОт			= ДокОснование.Контрагент;
		КонтрагентЦБ		= Контрагент.Ведущий;
		Договор 			= ДокОснование.Договор;		
		
		Сумма 				= ДокОснование.СуммаДокумента;
		Валюта 				= ДокОснование.Валюта;
		
		СтатьяДДС			= Справочники.СтатьиЗатрат.НайтиПоКоду("211 100"); //выручка
		//крохин начало 26.06.2017
		Кассир              = ПараметрыСеанса.Пользователь.ФизЛицо;  
		//крохин конец 26.06.2017
	КонецЕсли;
	
	Комментарий 		= "На основании: "+ДокОснование;		
	Основание			= ""+ДокОснование;
	ВидОперации			= Перечисления.ВидыОперацийПКО.ОплатаПокупателя;
	
	//крохин начало
	Если Дата > '20100601' И Контрагент <> Справочники.Контрагенты.ПустаяСсылка() И Контрагент.родитель <> Подразделение.ЧастноеЛицо.Родитель Тогда
		ДопПроводки = Истина;	
	Иначе
		ДопПроводки = Ложь;
	КонецЕсли;
	//крохин конец	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Автор   = Неопределено;
	Курс	= 0;
	Дата	= Неопределено;	
	
	
	//крохин начало 07.03.2012
	ДокОснование = Неопределено;
	//крохин конец 07.03.2012
	
		//крохин начало 05.02.2014
	Если ТипЗнч(Контрагент)=Тип("СправочникСсылка.Контрагенты") Тогда
	КонтрагентЦБ=Контрагент.Ведущий;	
	Если Договор.КодЦБ<>Контрагент.КодЦБ Тогда
	//	Сообщить("не совпадет договор и контрагент");
			Договор=Неопределено;			
		КонецЕсли; 	
	ИначеЕсли ТипЗнч(Контрагент)=Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Если Договор.Владелец <> Контрагент Тогда
	//	Сообщить("не совпадет договор и контрагент");
		Договор=Неопределено;	
		КонецЕсли;
	КонецЕсли;
		
	//крохин конец 05.02.2014
	
//нечаева 20,08,14 +++ начало
	Если договор.НеИспользовать Тогда
		//Предупреждение("Договор не предназначен для использования в документах");
		договор = Неопределено;
	КонецЕсли;
	//нечаева 20,08,14 конец
    ЧекПробитНаККМ = Ложь;
	НомерЧекаККМ = Ложь;
	
КонецПроцедуры

//Катаев+ 08/10/14
Процедура ПриЗаписи(Отказ)
	Если НужноВыгружать Тогда
		ЗанестиФилиалыВРегистрПолучателей(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры
//Катаев- 08/10/14
